<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Property search zones (fallback when asset-zones API is unavailable)
    |--------------------------------------------------------------------------
    */

    [
        'id' => '3306241f-2270-4172-a8f2-bed2bc1f6402',
        'name' => 'โซนกรุงเทพฯชั้นใน',
        'seq' => 10,
    ],
    [
        'id' => '85726a94-f34d-48da-8c1e-007556e24c7d',
        'name' => 'โซนทิศตะวันออกเฉียงใต้',
        'seq' => 20,
    ],
    [
        'id' => '9bc46fdd-8214-4061-adb0-86aadc3c4c97',
        'name' => 'โซนทิศตะวันออก',
        'seq' => 30,
    ],
    [
        'id' => 'b0e36b3b-afa4-4734-9828-ea445c04f387',
        'name' => 'โซนทิศเหนือ',
        'seq' => 40,
    ],
    [
        'id' => 'b2cde841-cfe7-48c9-a6f9-5256fc99aea2',
        'name' => 'โซนทิศตะวันตก',
        'seq' => 50,
    ],
    [
        'id' => 'c0668a61-6f9e-44b9-9b01-76112dc8cb9f',
        'name' => 'โซนต่างจังหวัด',
        'seq' => 60,
    ],

];
