<?php

namespace App\Http\Controllers;

use Illuminate\View\View;

class CareerController extends Controller
{
    public function index(): View
    {
        return view('pages.careers.index', [
            'qualifications' => [
                'ต้องจบการศึกษาในระดับปริญญาตรีขึ้นไป (ถ้าจบการศึกษา ปวส. ต้องมีประสบการณ์ในการทำงานอย่างอื่นมาบ้างไม่น้อยกว่า 2 ปี ขึ้นไป',
                'รับเฉพาะคนที่ต้องการทำงานในอาชีพตัวแทนขายอสังหาริมทรัพย์อย่างจริงๆ (ไม่รับ Freelanee หรือทำงาน Parttime)',
                'ต้องการคนที่อยากทำงานแล้วได้รายได้เยอะตามความสามารถของตัวเอง',
                'มีความขยัน ซื่อสัตย์ อดทน และตั้งใจทำงาน (ไม่จำกัดเรื่องอายุ เพศ)',
                'มีมนุษย์สัมพันธ์ดี มีใจรักงานด้านการขายและการบริการ สามารถเรียนรู้เพื่อการพัฒนาตัวเอง เพื่อนำไปสู่การเป็นมืออาชีพจริงๆ',
            ],
            'documents' => [
                'สำเนาบัตรประชาชน',
                'สำเนาทะเบียนบ้าน',
                'สำเนาวุฒิการศึกษา',
                'รูปถ่าย 1-2 นิ้ว 1 รูป',
            ],
        ]);
    }
}
