<?php

namespace App\Http\Controllers;

use Illuminate\View\View;

class ServiceController extends Controller
{
    public function index(): View
    {
        $servicePoints = [
            'บริษัทของเราเป็นเครือข่ายของ ERA และเป็นตัวแทนขายอสังหาริมทรัพย์แห่งแรกของประเทศไทย ดำเนินกิจการมาเกือบ 30 ปี มีพนักงานขายในเครือข่ายรวมกันมากกว่า 1,000 คน เรามีระบบ Co-brokers ระหว่างบริษัท และระบบ Co-sales ภายในบริษัท ที่สามารถช่วยกันขาย โดยที่ทางผู้ขายไม่ต้องจ่ายค่าคอมมิชชั่นให้ทั้ง 2 ที่ โดยทางบริษัทจะแบ่งค่าคอมมิชชั่นกันเองซึ่งเป็นไปตามกฎระเบียบของสมาคมนายหน้า',
            'เนื่องจากทางเรามีประสบการณ์ในการขายมาเกือบ 30 ปี ดังนั้นเราจึงมีข้อมูลของราคาทรัพย์ที่ขายไปแล้วได้จริงๆ จึงสามารถแนะนำราคาขายที่เหมาะสม (ราคาตลาด) ให้กับทางผู้ขายเพื่อเป็นแนวทางในการตั้งราคาขาย',
            'บริษัทของเรามีผู้ซื้อที่รอการซื้อทรัพย์ในทำเลที่ต้องการและอยู่ในงบประมาณที่ตั้งไว้ สำหรับผู้ที่ได้ฝากขายกับทางบริษัท ทางเราจะส่งลิงก์ข้อมูลไปยังกลุ่มผู้ซื้อเหล่านี้เป็นกลุ่มแรก',
            'ในเว็บไซต์ของเรา https://www.lovethaihome.com ทางเราได้ทำการซื้อโฆษณากับทาง Google AdWords และทำ SEO เพื่อให้ผู้ที่ค้นหาอสังหาริมทรัพย์สามารถเจอประกาศของเราได้ง่ายขึ้น',
            'ทางบริษัทเราได้ซื้อโฆษณาในเว็บไซต์ดังๆหลายเว็บ และเว็บไซต์ชั้นนำอื่นๆอีกมากมาย ทั้งยังมีทีมงานที่คอยดันประกาศเพื่อให้ข้อมูลนั้นอัปเดตตลอดเวลา',
            'ในส่วนของโซเชียลมีเดีย (Social Media) เราดูแลครบช่องทาง ทั้ง Facebook, เพจ, IG, LINE, Twitter/X, YouTube และ TikTok',
            'ถ้าลูกค้าต้องการซื้อ-ฝากขาย หรือต้องการสอบถามข้อมูลเพิ่มเติม สามารถติดต่อผ่านไลน์ โดยไอดีไลน์คือ @ERA101',
            'นโยบายของบริษัทจะเก็บค่าคอมมิชชั่นเพียงแค่ 3% จากราคาที่ขายได้ และไม่มีการเก็บค่าใช้จ่ายอื่นๆนอกเหนือจากนี้ รวมถึงไม่มีนโยบายบวกราคาขาย',
            'ในกรณีที่ทรัพย์ต้องการรีบขายและตั้งขายในราคาต่ำกว่าราคาตลาด ทางบริษัทจะช่วยทำคลิปโฆษณาเพิ่มอีกหนึ่งช่องทาง เพื่อช่วยดึงดูดความสนใจจากผู้ซื้อมากกว่าภาพนิ่ง',
            'ทางบริษัทจะช่วยวิเคราะห์เครดิตของผู้ซื้อก่อนจะพาชมทรัพย์สิน เพื่อลดการเสียเวลาและเพิ่มโอกาสในการปิดการขายให้จบได้จริง',
        ];

        return view('pages.services.index', [
            'servicePoints' => $servicePoints,
        ]);
    }
}
